Лабораторная работа - Настройка NAT для IPv4

Топология

![image](https://github.com/DowningSun/OTUS/assets/156109695/57de33b8-737f-4d78-8f6e-b838919b3285)


Таблица адресации

| Устройство | Интерфейс | IP-адрес | Маска подсети |
| ------ | ------ | ------ | ------ |
| R2 | G0/0/0 | 209.165.200.230 | 255.255.255.248 |
|   | G0/0/1 | 192.168.1.1 | 255.255.255.0 |
| R2 | G0/0/0 | 209.165.200.225 | 255.255.255.248 |
|   | Lo1 | 209.165.200.1 | 255.255.255.224 |
| S1 | VLAN 1 | 192.168.1.11 | 255.255.255.0 |
| S2 | VLAN 1 | 192.168.1.12 | 255.255.255.0 |
| PC-A | NIC | 192.168.1.2 | 255.255.255.0 |
| PC-B | NIC | 192.168.1.3 | 255.255.255.0 |

**Ход работы**


**Часть 1. Создание сети и настройка основных параметров устройства**

**Шаг 1. Подключите кабели сети согласно приведенной топологии.**

**Шаг 2. Произведите базовую настройку маршрутизаторов.**

a. Назначьте маршрутизатору имя устройства.

b. Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введенные команды таким образом, как будто они являются именами узлов.
                
c. Назначьте class в качестве зашифрованного пароля привилегированного режима EXEC.
                
d. Назначьте cisco в качестве пароля консоли и включите вход в систему по паролю.
                
e. Назначьте cisco в качестве пароля VTY и включите вход в систему по паролю.
                
f. Зашифруйте открытые пароли.
                
g. Создайте баннер с предупреждением о запрете несанкционированного доступа к устройству.
                
h. Настройте IP-адресации интерфейса, как указано в таблице выше.
                
i. Настройте маршрут по умолчанию. от R2 до  R1.
                
j. Сохраните текущую конфигурацию в файл загрузочной конфигурации.

**Шаг 3. Настройте базовые параметры каждого коммутатора.**

a. Присвойте коммутатору имя устройства.

b. Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введенные команды таким образом, как будто они являются именами узлов.

c. Назначьте class в качестве зашифрованного пароля привилегированного режима EXEC.

d. Назначьте cisco в качестве пароля консоли и включите вход в систему по паролю.

e. Назначьте cisco в качестве пароля VTY и включите вход в систему по паролю.

f. Зашифруйте открытые пароли.

g. Создайте баннер с предупреждением о запрете несанкционированного доступа к устройству.

h. Выключите все интерфейсы, которые не будут использоваться.

i. Настройте IP-адресации интерфейса, как указано в таблице выше.

j. Сохраните текущую конфигурацию в файл загрузочной конфигурации.


**Часть 2. Настройка и проверка NAT для IPv4.**

**Шаг 1. Настройте NAT на R1, используя пул из трех адресов 209.165.200.226-209.165.200.228.** 


a. Настройте простой список доступа, который определяет, какие хосты будут разрешены для трансляции. В этом случае все устройства в локальной сети R1 имеют право на трансляцию.

R1(config)# access-list 1 permit 192.168.1.0 0.0.0.255 

b. Создайте пул NAT и укажите ему имя и диапазон используемых адресов.

R1(config)# ip nat pool PUBLIC_ACCESS 209.165.200.226 209.165.200.228 netmask 255.255.255.248 

Примечание. Параметр маски сети не является разделителем IP-адресов. Это должна быть правильная маска подсети для назначенных адресов, даже если вы используете не все адреса подсети в пуле. 

c. Настройте перевод, связывая ACL и пул с процессом преобразования.

R1(config)# ip nat inside source list 1 pool PUBLIC_ACCESS 

Примечание: Три очень важных момента. Во-первых, слово «inside» имеет решающее значение для работы такого рода NAT. Если вы опустить его, NAT не будет работать. Во-вторых, номер списка — это номер ACL, настроенный на предыдущем шаге. В-третьих, имя пула чувствительно к регистру. 

d. Задайте внутренний (inside) интерфейс. 

R1(config)# interface g0/0/1

R1(config-if)# ip nat inside

e. Определите внешний (outside) интерфейс.

R1(config)# interface g0/0/0

R1(config-if)# ip nat outside

Шаг 2. Проверьте и проверьте конфигурацию. 

a. С PC-B,  запустите эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните процес поиска и устранения неполадок. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

R1# show ip nat translations

Pro Inside global Inside local Outside local Outside global

--- 209.165.200.226 192.168.1.3 --- --- 
226:1 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:1 
Total number of translations: 2

**Вопросы:**

Во что был транслирован внутренний локальный адрес PC-B?


 
Какой тип адреса NAT является переведенным адресом?
 

b. С PC-A, запустите  эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

R1# show ip nat translations 

Pro Inside global Inside local Outside local Outside global
--- 209.165.200.227 192.168.1.2 --- ---
--- 209.165.200.226 192.168.1.3 --- ---
227:1 192.168.1. 2:1 209.165.200. 1:1 209.165.200. 1:1
226:1 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:1
Total number of translations: 4

c. Обратите внимание, что предыдущая трансляция для PC-B все еще находится в таблице. Из S1, эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. Если эхо-запрос не прошел, выполните отладку. На R1 отобразите таблицу NAT на R1 с помощью команды show ip nat translations.

R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
--- 209.165.200.227 192.168.1.2 --- ---
--- 209.165.200.226 192.168.1.3 --- ---
--- 209.165.200.228 192.168.1.11 --- ---
226:1 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:1
228:0 192.168.1. 11:0 209.165.200. 1:0 209.165.200. 1:0 209.165.200. 1:0
Total number of translations: 5

d. Теперь запускаем пинг R2 Lo1 из S2. На этот раз перевод завершается неудачей, и вы получаете эти сообщения (или аналогичные) на консоли R1:

Sep 23 15:43:55.562: %IOSXE-6-PLATFORM: R0/0: cpp_cp: QFP:0.0 Thread:000 TS:00000001473688385900 %NAT-6-ADDR_ALLOC_FAILURE: Address allocation failed; pool 1 may be exhausted [2]
                e. Это ожидаемый результат, потому что выделено только 3 адреса, и мы попытались ping Lo1 с четырех устройств. Напомним, что NAT — это трансляция «один-в-один». Как много выделено трансляций? Введите команду show ip nat translations verbose , и вы увидите, что ответ будет 24 часа.
R1# show ip nat translations verbose 
Pro Inside global Inside local Outside local Outside global
--- 209.165.200.226 192.168.1.3 --- ---
  create: 09/23/19 15:35:27, use: 09/23/19 15:35:27, timeout: 23:56:42
  Map-Id(In): 1
<output omitted>

f. Учитывая, что пул ограничен тремя адресами, NAT для пула адресов недостаточно для нашего приложения. Очистите преобразование NAT и статистику, и мы перейдем к PAT.
R1# clear ip nat translations * 
R1# clear ip nat statistics 
